
Switch>
Switch>terminal width 511
Switch>terminal length 0
Switch>
Switch>
Switch>enable
Password: 
Switch#
Switch#
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Switch(config)#int fa0/22
Switch(config-if)#switchport mode access
Switch(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on FastEthernet0/22 but will only
 have effect when the interface is in a non-trunking mode.
Switch(config-if)#switchport access vlan 233
% Access VLAN does not exist. Creating vlan 233
Switch(config-if)#
Switch(config-if)#end
Switch#
Switch#
Switch#
Switch#write mem
Building configuration...
[OK]
Switch#
Switch#exit
